mslawicz/ZB_strip_controller/STM32_WPAN/App/app_zigbee.c
/* ColorControl server step_color_xy 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_step_color_xy(struct ZbZclClusterT *cluster, struct ZbZclColorClientStepColorXYReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 12 ColorControl server 1 step_color_xy 1 */
  APP_DBG("colorControl_server_1_step_color_xy");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 12 ColorControl server 1 step_color_xy 1 */
}

/* ColorControl server move_to_color_temp 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_move_to_color_temp(struct ZbZclClusterT *cluster, struct ZbZclColorClientMoveToColorTempReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 13 ColorControl server 1 move_to_color_temp 1 */
  APP_DBG("colorControl_server_1_move_to_color_temp");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 13 ColorControl server 1 move_to_color_temp 1 */
}

/* ColorControl server move_to_hue_enh 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_move_to_hue_enh(struct ZbZclClusterT *cluster, struct ZbZclColorClientMoveToHueEnhReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 14 ColorControl server 1 move_to_hue_enh 1 */
  APP_DBG("colorControl_server_1_move_to_hue_enh");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 14 ColorControl server 1 move_to_hue_enh 1 */
}

/* ColorControl server move_hue_enh 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_move_hue_enh(struct ZbZclClusterT *cluster, struct ZbZclColorClientMoveHueEnhReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 15 ColorControl server 1 move_hue_enh 1 */
  APP_DBG("colorControl_server_1_move_hue_enh");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 15 ColorControl server 1 move_hue_enh 1 */
}

/* ColorControl server step_hue_enh 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_step_hue_enh(struct ZbZclClusterT *cluster, struct ZbZclColorClientStepHueEnhReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 16 ColorControl server 1 step_hue_enh 1 */
  APP_DBG("colorControl_server_1_step_hue_enh");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 16 ColorControl server 1 step_hue_enh 1 */
}

/* ColorControl server move_to_hue_sat_enh 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_move_to_hue_sat_enh(struct ZbZclClusterT *cluster, struct ZbZclColorClientMoveToHueSatEnhReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 17 ColorControl server 1 move_to_hue_sat_enh 1 */
  APP_DBG("colorControl_server_1_move_to_hue_sat_enh");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 17 ColorControl server 1 move_to_hue_sat_enh 1 */
}

/* ColorControl server color_loop_set 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_color_loop_set(struct ZbZclClusterT *cluster, struct ZbZclColorClientColorLoopSetReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 18 ColorControl server 1 color_loop_set 1 */
  APP_DBG("colorControl_server_1_color_loop_set");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 18 ColorControl server 1 color_loop_set 1 */
}

/* ColorControl server stop_move_step 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_stop_move_step(struct ZbZclClusterT *cluster, struct ZbZclColorClientStopMoveStepReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 19 ColorControl server 1 stop_move_step 1 */
  APP_DBG("colorControl_server_1_stop_move_step");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 19 ColorControl server 1 stop_move_step 1 */
}

/* ColorControl server move_color_temp 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_move_color_temp(struct ZbZclClusterT *cluster, struct ZbZclColorClientMoveColorTempReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 20 ColorControl server 1 move_color_temp 1 */
  APP_DBG("colorControl_server_1_move_color_temp");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 20 ColorControl server 1 move_color_temp 1 */
}

/* ColorControl server step_color_temp 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_step_color_temp(struct ZbZclClusterT *cluster, struct ZbZclColorClientStepColorTempReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 21 ColorControl server 1 step_color_temp 1 */
  APP_DBG("colorControl_server_1_step_color_temp");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 21 ColorControl server 1 step_color_temp 1 */
}

/* LevelControl server move_to_level 1 command callback */
static enum ZclStatusCodeT levelControl_server_1_move_to_level(struct ZbZclClusterT *cluster, struct ZbZclLevelClientMoveToLevelReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 22 LevelControl server 1 move_to_level 1 */
  APP_DBG("levelControl_server_1_move_to_level, level=%u, trans=%u, with_onoff=%u", req->level, req->transition_time, req->with_onoff);
  light_params.level_on = req->level;
  if(req->with_onoff)
  {
    light_params.level_target = light_params.level_on;
    light_params.transition_time = req->transition_time * 100;  /* conversion to milliseconds */
  }
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 22 LevelControl server 1 move_to_level 1 */
}

/* LevelControl server move 1 command callback */
static enum ZclStatusCodeT levelControl_server_1_move(struct ZbZclClusterT *cluster, struct ZbZclLevelClientMoveReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 23 LevelControl server 1 move 1 */
  APP_DBG("levelControl_server_1_move");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 23 LevelControl server 1 move 1 */
}

/* LevelControl server step 1 command callback */
static enum ZclStatusCodeT levelControl_server_1_step(struct ZbZclClusterT *cluster, struct ZbZclLevelClientStepReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 24 LevelControl server 1 step 1 */
  APP_DBG("levelControl_server_1_step");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 24 LevelControl server 1 step 1 */
}

